# Data manipulation

In [2]:
library(dplyr)

In [4]:
library(tidyverse)

In [6]:
library(gapminder)

In [8]:
data <- gapminder

In [10]:
class(data)

[1] "tbl_df"     "tbl"        "data.frame"

In [12]:
head(data)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [14]:
str(data)

tibble [1,704 x 6] (S3: tbl_df/tbl/data.frame)
 $ country  : Factor w/ 142 levels "Afghanistan",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ continent: Factor w/ 5 levels "Africa","Americas",..: 3 3 3 3 3 3 3 3 3 3 ...
 $ year     : int [1:1704] 1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 ...
 $ lifeExp  : num [1:1704] 28.8 30.3 32 34 36.1 ...
 $ pop      : int [1:1704] 8425333 9240934 10267083 11537966 13079460 14880372 12881816 13867957 16317921 22227415 ...
 $ gdpPercap: num [1:1704] 779 821 853 836 740 ...

In [16]:
glimpse(data)

Rows: 1,704
Columns: 6
$ country   <fct> "Afghanistan", "Afghanistan", "Afghanistan", "Afghanistan", ~
$ continent <fct> Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, ~
$ year      <int> 1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, ~
$ lifeExp   <dbl> 28.801, 30.332, 31.997, 34.020, 36.088, 38.438, 39.854, 40.8~
$ pop       <int> 8425333, 9240934, 10267083, 11537966, 13079460, 14880372, 12~
$ gdpPercap <dbl> 779.4453, 820.8530, 853.1007, 836.1971, 739.9811, 786.1134, ~

In [18]:
tail(data)

  country  continent year lifeExp pop      gdpPercap
1 Zimbabwe Africa    1982 60.363   7636524 788.8550
2 Zimbabwe Africa    1987 62.351   9216418 706.1573
3 Zimbabwe Africa    1992 60.377  10704340 693.4208
4 Zimbabwe Africa    1997 46.809  11404948 792.4500
5 Zimbabwe Africa    2002 39.989  11926563 672.0386
6 Zimbabwe Africa    2007 43.487  12311143 469.7093

In [20]:
summary(data)

        country        continent        year         lifeExp
 Afghanistan:  12   Africa  :624   Min.   :1952   Min.   :23.60
 Albania    :  12   Americas:300   1st Qu.:1966   1st Qu.:48.20
 Algeria    :  12   Asia    :396   Median :1980   Median :60.71
 Angola     :  12   Europe  :360   Mean   :1980   Mean   :59.47
 Argentina  :  12   Oceania : 24   3rd Qu.:1993   3rd Qu.:70.85
 Australia  :  12                  Max.   :2007   Max.   :82.60
 (Other)    :1632
      pop              gdpPercap
 Min.   :6.001e+04   Min.   :   241.2
 1st Qu.:2.794e+06   1st Qu.:  1202.1
 Median :7.024e+06   Median :  3531.8
 Mean   :2.960e+07   Mean   :  7215.3
 3rd Qu.:1.959e+07   3rd Qu.:  9325.5
 Max.   :1.319e+09   Max.   :113523.1

In [21]:
austria <- filter(data, country == "Austria")
austria

   country continent year lifeExp pop     gdpPercap
1  Austria Europe    1952 66.800  6927772  6137.076
2  Austria Europe    1957 67.480  6965860  8842.598
3  Austria Europe    1962 69.540  7129864 10750.721
4  Austria Europe    1967 70.140  7376998 12834.602
5  Austria Europe    1972 70.630  7544201 16661.626
6  Austria Europe    1977 72.170  7568430 19749.422
7  Austria Europe    1982 73.180  7574613 21597.084
8  Austria Europe    1987 74.940  7578903 23687.826
9  Austria Europe    1992 76.040  7914969 27042.019
10 Austria Europe    1997 77.510  8069876 29095.921
11 Austria Europe    2002 78.980  8148312 32417.608
12 Austria Europe    2007 79.829  8199783 36126.493

In [23]:
austria <- filter(data, country == "Austria", year > 1980)
austria

  country continent year lifeExp pop     gdpPercap
1 Austria Europe    1982 73.180  7574613 21597.08
2 Austria Europe    1987 74.940  7578903 23687.83
3 Austria Europe    1992 76.040  7914969 27042.02
4 Austria Europe    1997 77.510  8069876 29095.92
5 Austria Europe    2002 78.980  8148312 32417.61
6 Austria Europe    2007 79.829  8199783 36126.49

Pipe - %>% - |>

In [26]:
library(magrittr)

In [30]:
austria <- data |> filter(country == "Austria") |> select(1,2,5)
austria

   country continent pop
1  Austria Europe    6927772
2  Austria Europe    6965860
3  Austria Europe    7129864
4  Austria Europe    7376998
5  Austria Europe    7544201
6  Austria Europe    7568430
7  Austria Europe    7574613
8  Austria Europe    7578903
9  Austria Europe    7914969
10 Austria Europe    8069876
11 Austria Europe    8148312
12 Austria Europe    8199783

In [32]:
data |> head()

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [34]:
data |> select(year, country, pop) |>
    slice(1:10)

   year country     pop
1  1952 Afghanistan  8425333
2  1957 Afghanistan  9240934
3  1962 Afghanistan 10267083
4  1967 Afghanistan 11537966
5  1972 Afghanistan 13079460
6  1977 Afghanistan 14880372
7  1982 Afghanistan 12881816
8  1987 Afghanistan 13867957
9  1992 Afghanistan 16317921
10 1997 Afghanistan 22227415

In [37]:
data |> select(1, 5) |>
    head()

  country     pop
1 Afghanistan  8425333
2 Afghanistan  9240934
3 Afghanistan 10267083
4 Afghanistan 11537966
5 Afghanistan 13079460
6 Afghanistan 14880372

In [39]:
data |> select(1:3, 5) |>
    head()

  country     continent year pop
1 Afghanistan Asia      1952  8425333
2 Afghanistan Asia      1957  9240934
3 Afghanistan Asia      1962 10267083
4 Afghanistan Asia      1967 11537966
5 Afghanistan Asia      1972 13079460
6 Afghanistan Asia      1977 14880372

In [43]:
data |> select(-c(1:3)) |>
    head()

  lifeExp pop      gdpPercap
1 28.801   8425333 779.4453
2 30.332   9240934 820.8530
3 31.997  10267083 853.1007
4 34.020  11537966 836.1971
5 36.088  13079460 739.9811
6 38.438  14880372 786.1134

In [45]:
data |> select(lifeExp, pop) |>
    head()

  lifeExp pop
1 28.801   8425333
2 30.332   9240934
3 31.997  10267083
4 34.020  11537966
5 36.088  13079460
6 38.438  14880372

In [47]:
data |> select(-lifeExp, -pop) |>
    head()

  country     continent year gdpPercap
1 Afghanistan Asia      1952 779.4453
2 Afghanistan Asia      1957 820.8530
3 Afghanistan Asia      1962 853.1007
4 Afghanistan Asia      1967 836.1971
5 Afghanistan Asia      1972 739.9811
6 Afghanistan Asia      1977 786.1134

In [49]:
data |> select(where(is.numeric)) |>
    head()

  year lifeExp pop      gdpPercap
1 1952 28.801   8425333 779.4453
2 1957 30.332   9240934 820.8530
3 1962 31.997  10267083 853.1007
4 1967 34.020  11537966 836.1971
5 1972 36.088  13079460 739.9811
6 1977 38.438  14880372 786.1134

In [51]:
data |> select(!where(is.numeric)) |>
    head()

  country     continent
1 Afghanistan Asia
2 Afghanistan Asia
3 Afghanistan Asia
4 Afghanistan Asia
5 Afghanistan Asia
6 Afghanistan Asia

In [54]:
data |> select(!where(is.numeric)) |>
    distinct()

    country                  continent
1   Afghanistan              Asia
2   Albania                  Europe
3   Algeria                  Africa
4   Angola                   Africa
5   Argentina                Americas
6   Australia                Oceania
7   Austria                  Europe
8   Bahrain                  Asia
9   Bangladesh               Asia
10  Belgium                  Europe
11  Benin                    Africa
12  Bolivia                  Americas
13  Bosnia and Herzegovina   Europe
14  Botswana                 Africa
15  Brazil                   Americas
16  Bulgaria                 Europe
17  Burkina Faso             Africa
18  Burundi                  Africa
19  Cambodia                 Asia
20  Cameroon                 Africa
21  Canada                   Americas
22  Central African Republic Africa
23  Chad                     Africa
24  Chile                    Americas
25  China                    Asia
26  Colombia                 Americas
27  Comoros                  Africa
28  Congo, Dem. Rep.         Africa
29  Congo, Rep.              Africa
30  Costa Rica               Americas
... ...                      ...
113 Sierra Leone             Africa
114 Singapore                Asia
115 Slovak Republic          Europe
116 Slovenia                 Europe
117 Somalia                  Africa
118 South Africa             Africa
119 Spain                    Europe
120 Sri Lanka                Asia
121 Sudan                    Africa
122 Swaziland                Africa
123 Sweden                   Europe
124 Switzerland              Europe
125 Syria                    Asia
126 Taiwan                   Asia
127 Tanzania                 Africa
128 Thailand                 Asia
129 Togo                     Africa
130 Trinidad and Tobago      Americas
131 Tunisia                  Africa
132 Turkey                   Europe
133 Uganda                   Africa
134 United Kingdom           Europe
135 United States            Americas
136 Uruguay                  Americas
137 Venezuela                Americas
138 Vietnam                  Asia
139 West Bank and Gaza       Asia
140 Yemen, Rep.              Asia
141 Zambia                   Africa
142 Zimbabwe                 Africa

In [64]:
set.seed(1)
data |> sample_n(5)

  country    continent year lifeExp pop      gdpPercap
1 Montenegro Europe    1992 75.435    621621  7003.3390
2 Hungary    Europe    1982 69.390  10705535 12545.9907
3 Benin      Africa    1992 53.919   4981671  1191.2077
4 Malawi     Africa    1977 43.767   5637246   663.2237
5 Thailand   Asia      1992 67.298  56667095  4616.8965

In [69]:
set.seed(1)
data |> sample_frac(0.01)

   country               continent year lifeExp pop        gdpPercap
1  Montenegro            Europe    1992 75.435      621621  7003.3390
2  Hungary               Europe    1982 69.390    10705535 12545.9907
3  Benin                 Africa    1992 53.919     4981671  1191.2077
4  Malawi                Africa    1977 43.767     5637246   663.2237
5  Thailand              Asia      1992 67.298    56667095  4616.8965
6  El Salvador           Americas  1962 52.307     2747687  3776.8036
7  China                 Asia      2002 72.028  1280400000  3119.2809
8  Chad                  Africa    1977 47.383     4388260  1133.9850
9  Peru                  Americas  2002 69.906    26769436  5909.0201
10 Senegal               Africa    2002 61.600    10870037  1519.6353
11 Greece                Europe    1992 77.030    10325429 17541.4963
12 Sao Tome and Principe Africa    1972 56.480       76595  1532.9853
13 Tanzania              Africa    1977 49.919    17129565   962.4923
14 Congo, Dem. Rep.      Africa    1977 47.804    26480870   795.7573
15 United States         Americas  1982 74.650   232187835 25009.5591
16 Angola                Africa    1952 30.015     4232095  3520.6103
17 Nigeria               Africa    1952 36.324    33119096  1077.2819

In [72]:
data |> slice(1:8)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134
7 Afghanistan Asia      1982 39.854  12881816 978.0114
8 Afghanistan Asia      1987 40.822  13867957 852.3959

In [75]:
data |> slice_head(n = 5)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811

In [77]:
data |> slice_tail(n = 5)

  country  continent year lifeExp pop      gdpPercap
1 Zimbabwe Africa    1987 62.351   9216418 706.1573
2 Zimbabwe Africa    1992 60.377  10704340 693.4208
3 Zimbabwe Africa    1997 46.809  11404948 792.4500
4 Zimbabwe Africa    2002 39.989  11926563 672.0386
5 Zimbabwe Africa    2007 43.487  12311143 469.7093

In [79]:
data |> slice_max(lifeExp, n = 5)

  country          continent year lifeExp pop       gdpPercap
1 Japan            Asia      2007 82.603  127467972 31656.07
2 Hong Kong, China Asia      2007 82.208    6980412 39724.98
3 Japan            Asia      2002 82.000  127065841 28604.59
4 Iceland          Europe    2007 81.757     301931 36180.79
5 Switzerland      Europe    2007 81.701    7554661 37506.42

In [81]:
data |> slice_min(lifeExp, n = 5)

  country      continent year lifeExp pop     gdpPercap
1 Rwanda       Africa    1992 23.599  7290203  737.0686
2 Afghanistan  Asia      1952 28.801  8425333  779.4453
3 Gambia       Africa    1952 30.000   284320  485.2307
4 Angola       Africa    1952 30.015  4232095 3520.6103
5 Sierra Leone Africa    1952 30.331  2143249  879.7877

In [84]:
data |> filter(year == 2007) |> slice_min(lifeExp, n = 10)

   country                  continent year lifeExp pop      gdpPercap
1  Swaziland                Africa    2007 39.613   1133066 4513.4806
2  Mozambique               Africa    2007 42.082  19951656  823.6856
3  Zambia                   Africa    2007 42.384  11746035 1271.2116
4  Sierra Leone             Africa    2007 42.568   6144562  862.5408
5  Lesotho                  Africa    2007 42.592   2012649 1569.3314
6  Angola                   Africa    2007 42.731  12420476 4797.2313
7  Zimbabwe                 Africa    2007 43.487  12311143  469.7093
8  Afghanistan              Asia      2007 43.828  31889923  974.5803
9  Central African Republic Africa    2007 44.741   4369038  706.0165
10 Liberia                  Africa    2007 45.678   3193942  414.5073

In [86]:
data |> filter(year == 1982) |> top_n(10, lifeExp)

   country          continent year lifeExp pop       gdpPercap
1  Canada           Americas  1982 75.76    25201900 22898.79
2  Greece           Europe    1982 75.24     9786480 15268.42
3  Hong Kong, China Asia      1982 75.45     5264500 14560.53
4  Iceland          Europe    1982 76.99      233997 23269.61
5  Japan            Asia      1982 77.11   118454974 19384.11
6  Netherlands      Europe    1982 76.05    14310401 21399.46
7  Norway           Europe    1982 75.97     4114787 26298.64
8  Spain            Europe    1982 76.30    37983310 13926.17
9  Sweden           Europe    1982 76.42     8325260 20667.38
10 Switzerland      Europe    1982 76.21     6468126 28397.72

In [90]:
data |> filter(year == 1982) |>
    arrange(desc(lifeExp)) |>
    head(5)

  country     continent year lifeExp pop       gdpPercap
1 Japan       Asia      1982 77.11   118454974 19384.11
2 Iceland     Europe    1982 76.99      233997 23269.61
3 Sweden      Europe    1982 76.42     8325260 20667.38
4 Spain       Europe    1982 76.30    37983310 13926.17
5 Switzerland Europe    1982 76.21     6468126 28397.72

In [94]:
data |>
    filter(year == 2007) |>
    arrange(desc(gdpPercap)) |> 
    mutate(gdpTotal = pop * gdpPercap / 10^6) |>
    head()

  country          continent year lifeExp pop       gdpPercap gdpTotal
1 Norway           Europe    2007 80.196    4627926 49357.19    228421.4
2 Kuwait           Asia      2007 77.588    2505559 47306.99    118530.5
3 Singapore        Asia      2007 79.972    4553009 47143.18    214643.3
4 United States    Americas  2007 78.242  301139947 42951.65  12934458.5
5 Ireland          Europe    2007 78.885    4109086 40676.00    167141.2
6 Hong Kong, China Asia      2007 82.208    6980412 39724.98    277296.7

In [98]:
data |>
    filter(year == 2007) |>
    arrange(desc(gdpPercap)) |> 
    mutate(gdpTotal = pop * gdpPercap / 10^6,
           country = toupper(country),
           lifeExp = ceiling(lifeExp)) |>
    head()

  country          continent year lifeExp pop       gdpPercap gdpTotal
1 NORWAY           Europe    2007 81        4627926 49357.19    228421.4
2 KUWAIT           Asia      2007 78        2505559 47306.99    118530.5
3 SINGAPORE        Asia      2007 80        4553009 47143.18    214643.3
4 UNITED STATES    Americas  2007 79      301139947 42951.65  12934458.5
5 IRELAND          Europe    2007 79        4109086 40676.00    167141.2
6 HONG KONG, CHINA Asia      2007 83        6980412 39724.98    277296.7

Europe -> EU

In [102]:
data |>
    filter(year == 2007) |>
    arrange(desc(gdpPercap)) |> 
    mutate(gdpTotal = pop * gdpPercap / 10^6,
           country = toupper(country),
           lifeExp = ceiling(lifeExp),
           continent = as.character(continent	),
         continent = ifelse(continent	 == "Europe", "EU", country)) |>
    head()

  country          continent        year lifeExp pop       gdpPercap gdpTotal
1 NORWAY           EU               2007 81        4627926 49357.19    228421.4
2 KUWAIT           KUWAIT           2007 78        2505559 47306.99    118530.5
3 SINGAPORE        SINGAPORE        2007 80        4553009 47143.18    214643.3
4 UNITED STATES    UNITED STATES    2007 79      301139947 42951.65  12934458.5
5 IRELAND          EU               2007 79        4109086 40676.00    167141.2
6 HONG KONG, CHINA HONG KONG, CHINA 2007 83        6980412 39724.98    277296.7

In [105]:
data |>
    rename(population = pop) |>
    head()

  country     continent year lifeExp population gdpPercap
1 Afghanistan Asia      1952 28.801   8425333   779.4453
2 Afghanistan Asia      1957 30.332   9240934   820.8530
3 Afghanistan Asia      1962 31.997  10267083   853.1007
4 Afghanistan Asia      1967 34.020  11537966   836.1971
5 Afghanistan Asia      1972 36.088  13079460   739.9811
6 Afghanistan Asia      1977 38.438  14880372   786.1134

In [108]:
data |>
    filter(year == 2007) |>
    group_by(continent) |>
    summarise(
        lifeExp2007 = mean(lifeExp),
        countries = n()
    )

  continent lifeExp2007 countries
1 Africa    54.80604    52
2 Americas  73.60812    25
3 Asia      70.72848    33
4 Europe    77.64860    30
5 Oceania   80.71950     2

In [110]:
data |>
    filter(year == 2007) |>
    group_by(continent) |>
    summarise(
        lifeExp2007 = mean(lifeExp),
        countries = n(),
        population = sum(pop)
    )

  continent lifeExp2007 countries population
1 Africa    54.80604    52         929539692
2 Americas  73.60812    25         898871184
3 Asia      70.72848    33        3811953827
4 Europe    77.64860    30         586098529
5 Oceania   80.71950     2          24549947

In [111]:
sum(data$pop)

[1] 50440465801

In [112]:
library(tidyr)

In [114]:
not_good_data <- data.frame(Name = c("Nick", "Jake", "Anna", "Jane", "Dina"),
                           q1_2021 = c(12442, 22131, 21343, 22111, 14123),
                           q2_2021 = c(13442, 22871, 20343, 22222, 14456),
                           q3_2021 = c(15482, 22031, 22456, 22444, 14533),
                           q4_2021 = c(14511, 20031, 21741, 22333, 14511))
not_good_data

  Name q1_2021 q2_2021 q3_2021 q4_2021
1 Nick 12442   13442   15482   14511
2 Jake 22131   22871   22031   20031
3 Anna 21343   20343   22456   21741
4 Jane 22111   22222   22444   22333
5 Dina 14123   14456   14533   14511

In [116]:
better_data <- not_good_data |>
    gather(quater, salary, 2:5)
better_data

   Name quater  salary
1  Nick q1_2021 12442
2  Jake q1_2021 22131
3  Anna q1_2021 21343
4  Jane q1_2021 22111
5  Dina q1_2021 14123
6  Nick q2_2021 13442
7  Jake q2_2021 22871
8  Anna q2_2021 20343
9  Jane q2_2021 22222
10 Dina q2_2021 14456
11 Nick q3_2021 15482
12 Jake q3_2021 22031
13 Anna q3_2021 22456
14 Jane q3_2021 22444
15 Dina q3_2021 14533
16 Nick q4_2021 14511
17 Jake q4_2021 20031
18 Anna q4_2021 21741
19 Jane q4_2021 22333
20 Dina q4_2021 14511

In [119]:
best_data <- better_data |>
    separate(quater, c("quater", "year"), sep = "_") 
best_data

   Name quater year salary
1  Nick q1     2021 12442
2  Jake q1     2021 22131
3  Anna q1     2021 21343
4  Jane q1     2021 22111
5  Dina q1     2021 14123
6  Nick q2     2021 13442
7  Jake q2     2021 22871
8  Anna q2     2021 20343
9  Jane q2     2021 22222
10 Dina q2     2021 14456
11 Nick q3     2021 15482
12 Jake q3     2021 22031
13 Anna q3     2021 22456
14 Jane q3     2021 22444
15 Dina q3     2021 14533
16 Nick q4     2021 14511
17 Jake q4     2021 20031
18 Anna q4     2021 21741
19 Jane q4     2021 22333
20 Dina q4     2021 14511

In [121]:
best_data <- best_data |>
    mutate(year = as.integer(year), # convert year to integer
           quater = substr(better_data$quater, 2,2), # trim `q` from start
           quater = as.integer(quater), # convert quater to integer
          )
best_data

   Name quater year salary
1  Nick 1      2021 12442
2  Jake 1      2021 22131
3  Anna 1      2021 21343
4  Jane 1      2021 22111
5  Dina 1      2021 14123
6  Nick 2      2021 13442
7  Jake 2      2021 22871
8  Anna 2      2021 20343
9  Jane 2      2021 22222
10 Dina 2      2021 14456
11 Nick 3      2021 15482
12 Jake 3      2021 22031
13 Anna 3      2021 22456
14 Jane 3      2021 22444
15 Dina 3      2021 14533
16 Nick 4      2021 14511
17 Jake 4      2021 20031
18 Anna 4      2021 21741
19 Jane 4      2021 22333
20 Dina 4      2021 14511

In [123]:
united_data <- best_data |>
    unite(Qt, quater, year, sep = "_")
united_data

   Name Qt     salary
1  Nick 1_2021 12442
2  Jake 1_2021 22131
3  Anna 1_2021 21343
4  Jane 1_2021 22111
5  Dina 1_2021 14123
6  Nick 2_2021 13442
7  Jake 2_2021 22871
8  Anna 2_2021 20343
9  Jane 2_2021 22222
10 Dina 2_2021 14456
11 Nick 3_2021 15482
12 Jake 3_2021 22031
13 Anna 3_2021 22456
14 Jane 3_2021 22444
15 Dina 3_2021 14533
16 Nick 4_2021 14511
17 Jake 4_2021 20031
18 Anna 4_2021 21741
19 Jane 4_2021 22333
20 Dina 4_2021 14511

In [125]:
latest_data <- united_data |>
    spread(Qt, salary)
latest_data

  Name 1_2021 2_2021 3_2021 4_2021
1 Anna 21343  20343  22456  21741
2 Dina 14123  14456  14533  14511
3 Jake 22131  22871  22031  20031
4 Jane 22111  22222  22444  22333
5 Nick 12442  13442  15482  14511